#უნდა დახატოთ paint ში ის თუ როგორ მუშაობს for ციკლი

#6) for ციკლის მეშვეობით შეასრულეთ ყველა მათემატიკური ოპერაცია 0-დან 100-მდე რიცხვებზე 

#7) მომხმარებელს შემოატანინეთ რიცხვი და შემდეგ for loop - ის გამოყენებით გამოიტანეთ ამ რიცხვამდე ყველა რიცხვის ჯამი(მაგალითად თუ შეიყვანს 10ს გამოიტანეთ 10მდე ყველა რიცხვის ჯამი მაგალითად).

#8) მომხმარებელს შემოატანინეთ ორი რიცხვი ხოლო ამის შემდეგ for loop - ის გამოყენებით გამოიტანეთ ამ რიცხვებს შორის ჯამი და ნამრავლი.


total=0
for i in range(1, 101):
    total+=i
print(total)
for i in range(1, 101):
    total-=i
print(total)
for i in range(1, 101):
    total*=i
print(total)
for i in range(1, 101):
    total/=i
print(total)
print(total)


    
