//!unshift
//*ეს მეთოდი რასაც მიუთითებ ამათებს სიაში დასაწყისში.
let arr = ['apple', 'banana']
arr.unshift('pineapple')
//*arr ეხლა არის: ['pineapple', 'apple', 'banana']


//!shift
//*ეს მეთოდი მითითებულ სიიდან აშორებს პირველ ელემენტს და მას აბრუნებს.
let arr1 = ['apple', 'banana']
let shift = arr1.shift()
//* shift = 'apple'
//* arr1 = ['banana']


//!splice
//* ეს მეთოდი მითითებულ ლისტიში რაიმეს დამატებისთვის, წაშლისთვის ან შეცვლისთვის გამოიყენება
//*arr.splice(საწყისი, წაშლის რაოდენობა(სურვილისამებრ), დასამატებელი ელემენტები(სურვილისამებრ))

//!წაშლა ელემენტების
let arr2 = [1, 2, 3, 4, 5]
arr2.splice(1, 2)
//* აშორებს 2 ელემენტს 1-ინდექსიდან. მოშორდა 2 და 3. დარჩა 1, 4, 5

//!დამატება ელემენტების
let arr3 = [1, 4, 5]
arr3.splice(1, 0, 2, 3)
//* 1-ინდექსიდან არაფერი მოუშორებია (0), და დაამატა ელემენტები: 2, 3 arr3 = 1, 2, 3, 4, 5

//!შეცვლა ელემენტების
let arr4 = [1, 2, 3, 4, 5]
arr4.splice(1, 2, 8, 9)
//* 1-ინდექსიდან ამოშალა 2 ელემენტი (2, 3) და ასევე 1-ინდექსზე ჩაამატა 2 ელემენტი (8, 9). ანუ გამოდის რომ აქ 2, 3 ჩანაცვლდა 8, 9 - თი



//!slice
//*ეს მეთოდი სიიდან ამოიღებს მითითებულ ნაწილს სიის შეცვლის გარეშე
//*სინტაქსი: arr.splice(საწყისი, დასასრული)
//*თუ მარტო საწყისი მიუთითე და დასასრული არა, მაშინ დასასრულს სიის ბოლომდე ჩათვლის
let arr5 = [1, 2, 3, 4, 5]
arr5.splice(1,3)
//*ამოშლის 1-ინდექსიდან 3-ინდექსამდე (2, 3, 4)
arr5.splice(1)
//*ამოშლის 1-ინდექსიდან ლისტის ბოლომდე ელემენტებს (2, 3, 4, 5)



//!concat
//*ეს მეთოდი მითითებულ ლისტებს ერთმანეთთან ამატებს ორიგინალი სიის შეცვლის გარეშე.
let arr6 = [1, 2]
let arr7 = [3, 4]
let arr8 = [5, 6]
arr6.concat(arr7)
//*ეს იქნება arr6=ის და arr7-ის ნაერთი (1, 2, 3, 4)
//*ასევე შეიძლება 1-ზე მეტი ლისტი ჩაამატო
arr6.concat(arr7, arr8)
//*ეს იქნება arr6=ის, arr7-ის და arr8-ის ნაერთი (1, 2, 3, 4, 5, 6)



//!sort
//*ეს მეთოდი გადაცემულ ლისტს ალფაბეტიკურად დაალაგებს რაც ცვლის ორიგინალ სიას.
let arr9 = ['banana', 'apple', 'coconut']
arr9.sort()
//*ეს იქნება ['apple', 'banana', 'coconut']



//!reverse
//*ეს მეთოდი გადაცემულ ლისტს აბრუნებს რითიც ცვლის ორიგინალ სიას.
let arr10 = [1, 2, 3, 4, 5]
arr10.reverse()
//*ეს იქნება [5, 4, 3, 2, 1]



//!join
//*ეს მეთოდი გადაცემულ სიას, გარდარქმნის სტრინგად. და ელემენტებს აშორებს რაც გადავეცით მეთოდს იმით.
let arr11 = ['hello', 'world']
arr11.join(" ")//!გამოტოვება თითო ელემენტზე
//*ეს გარდაიქმნება სტრინგად: "hello world"
//*არაფერი რომ არ გადაგვეცა მეთოდისთვის მაშინ გამოიტანდა: "hello, world"