def area_calculation(a, b=0, c=0):
    if not b and not c:
        #? თუ b და c მითითებული არ არის მაშინ ნიშნავს რომ a მითითებულია. ამიტომ კოდი აღიქვამს ამას როგორც რადიუსს. და ითვლის წრის ფართობს
        pi = 3.14159
        circle = pi * a **2
        print(circle)
    elif not c:
        #*თუ c უდრის ნულს, მაშინ ეს ნიშნავს რომ დანარჩენი 2 გვერდი მითითებული არის. ამიტომ ეს გამოდის ოთხკუთხედი. რაც ითვლის ოთხკუთხედის ფარობს
        square = a * b
        print(square)
    elif a > 0 and b > 0 and c > 0: 
        #!ამითი ვამოწმებ თუ ყველა სამი გვერდი 0ზე მეტი იქნება სამკუთხედი იქნება თუ არა სწორი. 2 გვერდის ჯამი მესამეზე ემტი უნდა იყოს და თუ ყველაფერი სწორია, ითვლება სამკუთხედის ფართობი
        s = (a + b + c) / 2
        triangle = (s*(s-a)*(s-b)*(s-c)) ** 0.5
        print(triangle)

area_calculation(2)