# 3) შექმენით  ფუნქცია რომელსაც დაარქმევთ manual_count, ამ ფუნქციას გაუწერეთ ორი პარამეტრი პირველი string, count_char, პირველ პარამეტრეს გადაეცემა სტრინგი და მეორეს სიმბოლო რომელიც გვინდა დავითვალოთ, ფუნქციამ უნდა დაითვალოს სტრინგში დასათველელი სიმბოლოს რაოდენობა, არ გამოიყენოთ count მეთოდი, გააკეთეთ ეს დავალება  for ციკლის დახმარებით, მიღებული შედეგი დააბრუნეთ return ის დახმარებით და დაბეჭდეთ დაბრუნებული მნიშვნელობა

# ისწავლეთ რას აკეთებს split, join, index მეთოდები

# 4) ასევე ისწავლეთ შემდეგი მეთოდები: islower(), isuper(), isnumeric(), isalpha(). თითოეულ მათგანზე გააკეთეთ მინიმუმ 5 - 5 მაგალითი

def manual_count(word, count_char):
    count = 0
    

    for character in word:
        if character == count_char:
            count += 1
            
    return count


result = manual_count("goa is the best in the whole world", 'o')
print(result)

#islower ფუნქციაა რომელიც აბრუნებს true-ს თუ მითითებულ სტრინგში ყველა სიმბოლო პატარა არის
#isupper ფუნქციაა რომელიც აბრუნებს true-ს თუ მითითებულ სტრინგში ყველა სიმბოლო დიდი არის
#isnumeric ფუნქციაა რომელიც აბრუნებს true-ს თუ მითითებულ სტრინგში ყველა სიმბოლო რიცხვი არის
#isalpha ფუნქციაა რომელიც აბრუნებს true-ს თუ ყველა სიმბოლო სტრინგში არის ინგლისური ალფაბეტიდან
