 #შექმენით პითონის ფაილი და 4 ჯერ გამოიყენეთ print ფუნქცია, პირველ პრინტში გამოიყენეთ ორ რიცხვს შორის შეკრება +, მეორეში - გამოკლება, მესამეში * გამრავლება, მეოთხეში / გაყოფა

print(5+5)
print(4-2)
print(5*5)
print(4/2)
# 1 მიმატება
# 2 გამოკლება
# 3 გამრავლება
# 4 გაყოფა


print("and" + "ria")
# ჩემი სახელი + მისი ტერმინალში ჩვენება


#დაუშვით ძალით შეცდომები და ნახეთ კომპიუტერი რას გამოგიტანთ შედეგად
print(hello world)
# კოდი არასწორია რათგან არ გამოვიყენე ბრჭყალები. ამიტომ ტერმინალში შედეგი არ არის


# ტერმინალი არის ფანჯარა სადაც ვნახულობთ კოდის მიერ მიღებულ შედეგებს. თუ კოდი არასწორია, შედეგი არ გამოვა



maklebi=5

saklebi=10

print(saklebi - maklebi)

# ორი ცვლადის მნიშვნელობისგან მიღებული მათემატიკური გამოთვლა





# სტრინგი არის სიმბოლოების რაოდენობა რომელიც არის მოთავსებული ბრჭყალებში ("") ბრჭყალების გარეშე არ დაიბეჭდება ტერმინალში

# მთელი რიცხვი არის ინტეჯერი (int) რომელსაც არ სჭირდება ბრჭყალები. შეიძლება იყოს უარყოფითი (-) და დადებითი 