let myarray = [1, 2, 2, 3, 4, 4, 5]
//* ვქმნი dictionary-ს სადაც შევინახავ შეხვედრილ რიცხვებს.
let counts = {}
function checkarray(array){
    //! ელემენტების შეხვედრის შენახვა.
    //* ვქმნი ვვლადს რასაც ვიხმარ თითო ინდექსის შესამოწმებლად.
    //! თუ i ინდექსზე მდგომი რიცხვი არის ჩაწერილი count disct-ში მაშინ კიდევ ერთი ემატება.
    //! თუ i ინდექსზე მდგომი რიცხვი არ არის ჩაწერილი count dict-ში მაშინ ის ჩაეწერება ამ dict-ში.
    for(let i = 0; i < array.length; i++){
        let value = array[i]
        if (counts[value]){
            counts[value] += 1
        }
        else{
            counts[value] = 1
        }
    }
    //* ვქმნი სიას სადაც ჩავწერ ერთხელ შეხვედრილ რიცხვებს.
    let appear_once = []
    //! თუ შემოწმებულ ელემენტების სიაში მარტო ერთხელ მეორდება counts[j] (ანუ მისი შიგთავსი / რიცხვი) 
    //! მაშინ ის ჩაიწერება ლისტში სადაც ვინახავთ რიცხვებს რომელიც მარტო ერთხელ გვხვდება
    //* იმიტომ დავწერე count[j] უბრალოდ j-s მაგივრად რომ j იქნებოდა string, და string-ს ვერ შეადარებ 1-ს. იმიტომ გამოვიყენე counts[j] რომ ეს მის შიგთავსს ნიშნავს,
    //* რაც არის integer
    for(let j in counts){
        if (counts[j] === 1){
            appear_once.push(j)
        }
    }
    //! გამომაქვს 1ხელ გამოჩენილი რიცხვები კონსოლში
    console.log(appear_once)
}
checkarray(myarray)
//გამოვა: 1, 3, 5
