//* encoding ნიშნავს ადამიანისთვის წასაკითხ ინფორმაციას გადაყვანას binary კოდად, მაგალითად ტექსტისთვის გამოიყენება ASCII ან  UTF-8, ფოტოებისთვის PNG ან JPEG, აუდიოსთვის mp3 და ასე შემდეგ.

//* encryprion კოდის გადაქცევა cipetext-ად, ანუ გარკვეული მათემატიკური ფორმულების მიხედვით კოდს გადრაქმნის წაუკითხავ კოდად. მის უკან დასაბრუნებლად სპეციალური დიგიტალური key იქნება საჭირო

//* hashing კოდის ისევ წაუკითხავ ტექსტად გადაქცევა მაგრამ ის შეუბრუნებელია და ვეღარ დაბრუნდება თავის ორიგინალ ფორმაში.


//* რისთვის გამოიყენება ისენი:
 
//* encoding გამოიყენება იმისთვის რომ კოდი წასაკითხი გავხადოთ განსხვავებული სისტემებ ისთვის და ფორმატებისთვის, და არა უსაფრთხოებისთვის

//* encryption გამოიყენება კოდის დამალვა იმ ხალხისტვის ვისაც კოდზე მიწვდომის საშუალება არ აქვთ, რისთვისაც გამოიყენება დიგიტალური გასაღები.

//* hashing უმეტესად გამოიყენება ინფორმაციის შესანახად როგორიც არის მაგალითად პაროლები. ის გამოიყენება ვერიფიკაციისთვის.